<template>
  <div class="mech">
    <h2>育人创新之三：全员育人长效机制</h2>
    <p v-for="(text,index) in textList" :key="index">{{text}}</p>
  </div>
</template>

<script>
export default {
    data () {
        return {
            textList: [
                '为了全面贯彻党的教育方针，做好育人工作，我系成立全员育人领导小组，负责全系育人工作改革与创新，经过深入调研与论证，结合本系的实际，制定了全员育人长效机制，无论是行政岗位、教师岗位或者是教辅岗位，都有 “管理育人、教书育人或服务育人”的具体任务，同时，引导学生参与育人工作，在全系形成良好的育人环境，具体做法如下：',
                '1.行政人员育人。作为行政人员，要按照联系班级制度开展工作，强化“教书育人、管理育人、服务育人”，更好地为学生提供优质服务，根据制度要求，每学期必须完成规定的工作任务。通过参加与联系班级的交流，重点了解和掌握所联系班级班风学风情况，了解学生的思想状况、学习情况、家庭情况、社会交往、人际关系、心理健康等情况，为学生答疑解惑，指导辅导员处理学生中出现的各种问题和突发事件，及时向有关部门反映学生的意见和建议。',
                '2. 专业教师育人。作为专业教师，要加强课堂管理，严格考勤制度，严肃课堂纪律，并有意识地把学生思想教育内容结合教材融化到教学活动中。课堂上，任课教师注意结合学生基础知识、学习状态，接受能力，改变传统单一的说教授课，运用CDIO教育理念开展项目教学，注重学生在学习过程中解决问题的能力培养，同时，在各个教学环节中注意引导学生学会学习、学会做事与学会做人。',
                '3. 实验管理员育人。作为实验管理员，要积极参与育人工作，负责对学生做好安全操作教育和指导，引导实训班级爱护实验设备，指导学生打扫与整理实训室，为专业教师与学生提供一个良好的实训环境，以达到环境育人的目的。',
                '4. 班主任育人。 作为班主任，要明确自己的职责与角色的转换，主要负责专业方面的学习引导，第1-4学期担任专业班主任，负责引导学生对专业的学习，第5学期变为就业指导教师，负责就业前的思想引导与教育，第6学期转变为顶岗实习指导教师，负责顶岗实习管理和就业推荐工作。',
                '5. 辅导员育人。作为辅导员，要秉持“以人为本德育为先”的工作理念，引导学生树立理想信念，关心学生学习生活，教育学生做人做事，帮助学生做好职业生涯规划，指导班级开展活动，营造良好班风学风。辅导员对工作认真负责，对学生细心关爱，既是学生的人生导师也是学生健康成长的知心朋友。',
                '6. 助导育人。 作为助导（挑选优秀的学生和党员积极分子担任），在系团总支和辅导员的具体指导下，从新生入校开始服务班级，组织新生参与各类教育教学活动，使新生尽快适应大学生活，同时，负责引导新生了解专业，解决学习和生活上的困惑，每个助导负责指导一个宿舍，一直负责到毕业。助导成为了新一届学生信赖的师哥师姐，也成为辅导员开展班级管理的得力助手。',
                '7. 自主育人。作为在校生，要学会感恩，感恩父母，感恩学校和老师，学会报答国家与学校给予的各种帮助，鼓励学生自发倡议做义工，做好事，把自己培养成为一个爱国、敬业、诚信、友善的大学生。',
                '8.开设特色课程，促进全人发展。除了学院开设的课程以外，我系在大一第一学期开设了《职业素质拓展I》这门课程，主要加深学生对专业的认识，让学生掌握专业的学习方法，培养学生自信心。第2-4学期开设《综合素质》课，利用星期二下午学习，分专题以小组形式开展，提高学生各种素质。第5学期开设《职业素质拓展II》这门课程，主要培养学生创新创业意识，关注身体素质，掌握沟通技巧，如何做一名优秀员工。',
                '我系每年对全员育人工作进行全面考核与评价，对教职工考核不合格，扣减当年5%的主岗位工作奖励性绩效，同时，对全员育人长效机制运行情况进行总结与完善。'
            ]
        }
    }
};
</script>

<style scoped>
.mech {
  width: 100%;
  margin-left: 20px;
  padding: 0px 15px 0px 15px;
  box-sizing: border-box;
  text-align: center;
}
.mech h2{
  display: block;
  font-size: 30px;
}
.mech span{
  display: block;
  font-size: 20px;
  font-weight: 400;
  margin: 30px 0px;
}
.mech > p {
  text-indent: 2em;
  font-size: 16px;
  line-height: 30px;
  color: #575959;
  text-align: left;
}
</style>