<template>
  <div class="idea">
    <h2>教学创新之二：教学模式创新</h2>
    <p v-for="text in textList" :key="text.id">{{text.text}}</p>
    <img src="@/assets/img/cace.png" alt />
    <p v-for="(item,index) in textA" :key="index">{{item}}</p>
  </div>
</template>

<script>
export default {
  data() {
      return {
          textList: [
              {text: '基于CDIO教育理念的项目教学模式是围绕多个完整的真实项目而开展的教学活动，是综合了当前传统探究教学、任务驱动教学和案例教学的特点，将学生探索兴趣、解决问题毅力和社会责任感的培养，融入到CDIO项目过程中，让学生积极地学习、自主地进行知识的建构，所有教学活动都是围绕真实的项目展开。具体说来，就是：所有需要学习和掌握的专业知识都围绕项目这个核心展开，并与这个核心融合在一起，形成一个有机整体。因此，我们在编制专业培养计划时，依据项目所涉及的专业知识范围以及项目本身的规模，为学生设置了一级、二级、三级项目。一级项目又称为课程项目，是指对专业课程设计的项目，二级项目又称为专业项目，是指具有本专业特色的项目，三级项目又称为企业项目，具体介绍如下：', id: 100}
          ],
          textA: [
              '①课程项目：课程项目是以专业核心课程大纲为依据来设计，整个教学过程是以项目为主线来进行，围绕项目的完成开发若干小项目单元，每个单元的实施都以CDIO理念为指导，即每做一个项目单元都包含构思、设计、实施、运作4个环节。课程项目由任课教师独立完成教学任务。一般安排在1～3学期进行。',
              '②专业项目：根据专业的培养目标来设计，是学生在完成核心课程学习与相关项目训练后，运用所学的知识，完成一个具有专业代表性的大项目，学生将经历项目构思、设计、实现、运用等全过程的训练，目的是让学生从解决实际工程问题出发来进行专业知识的学习，激发学生对实际工程问题的兴趣，引导他们探索并掌握解决问题的途径和方法。专业项目主要安排在第4～5学期进行。',
              '③企业项目：学生直接参与企业开发的项目。项目主要来源于企业或对外承接，与本专业相关的，主要在校内实验室完成。一般安排在第5～6学期进行。如，信息管理专业学生通过网络参与企业项目开发，为企业开发网站、拖管网站和更新网站等，同时，组织有兴趣的同学组成学习小组在创新创业工作室参加各项训练，培养学生独立开发企业项目的能力。',
              '目前，我系六个专业已按CDIO教学模式的要求修改2016级教学计划，确定了各专业的核心课程，增加了《专业项目》这门课程，并对这些课程的课时与学习安排进行了充分的讨论，为在全系全面推行三级项目教学模式打下良好的基础。'
          ]
      }
  }
};
</script>

<style scoped>
.idea {
  width: 100%;
  margin-left: 20px;
  padding: 0px 15px 0px 15px;
  box-sizing: border-box;
  text-align: center;
}
.idea h2{
  display: block;
  font-size: 30px;
}
.idea span{
  display: block;
  font-size: 20px;
  font-weight: 400;
  margin: 30px 0px;
}
.idea > p {
  text-indent: 2em;
  font-size: 16px;
  line-height: 30px;
  color: #575959;
  text-align: left;
}
</style>