<template>
    <div class="apply">
        <h2>计算机应用技术专业简介</h2>
        <alutext :title="titleList" :imgSrc="imgSrc"></alutext>
    </div>
</template>

<script>
import alutext from "./alutext";

export default {
    data () {
        return {
            titleList: [
                ' 计算机应用技术专业是我院最早举办高职教育的专业之一，是自治区级优质专业，建有自治区级示范性高等职业教育实训基地——计算机应用与软件技术实训基地；拥有雄厚的师资力量，教师教学水平高，实践能力强；我们注重对学生实践能力和创新能力的培养；多年来，学生在各级竞赛屡创佳绩，毕业生就业率高，多次荣获学院就业先进集体，毕业生深受企业欢迎，为行业知名企业如华为、重庆中联等培养了大量优秀毕业生。',
                '一、培养目标：培养适合市场需求，德、智、体、美全面发展，掌握一定的专业理论知识，具有良好的职业道德和创新精神，具备网站设计与开发、软件设计与开发、移动互联网应用设计与开发、平面广告设计、数据库应用与管理等有可持续发展能力的高素质技术技能型专业人才。',
                '二、师资队伍：本专业拥有一支年富力强，知识结构合理的师资队伍，教师素质过硬，富有创新精神，有丰富的教学经验和实践能力，现有专兼职教师15人，其中：高级职称6人，中级职称7人，初级职称2名。在科研教改方面，本专业承担厅级以上的科研项目共6项，院级科研项目18项，在国内正式刊物上发表论文50多篇，出版高职高专规划教材5部，校本教材教参6部。',
                '三、主干课程：本专业开设的课程均根据当前社会的前沿技术，企业热门岗位进行开设，涵盖多领域计算机软件应用与开发技术，满足不同就业需求，主要课程有：网页制作、网页界面设计、Web前端技术、UI设计、PHP程序设计、Java程序设计、JSP程序设计、移动应用开发、数据库管理系统基础（SQL Server）、Oracle数据库、Photoshop图像处理、Coreldraw图形设计、Illustrator图形设计、平面广告项目设计等。',
                '四、实训基地建设：建有省级示范性实训基地——计算机应用与软件技术实训基地。该基地有计算机基础技术中心、网络技术中心、软件开发与维护技术中心、网站设计与维护技术中心、多媒体与影视技术中心等5个校内实训基地，可以按照职业岗位要求开展职业技能训练和职业素质训导；另外，与重庆中联信息产业有限责任公司、广州多迪网络科技有限公司、南宁市平方软件新技术有限责任公司等多家企业建立了校外实习、实训基地。',
                '五、就业方向：本专业毕业生可在企事业单位从事网页美工、网站设计与开发、软件开发、UI设计、平面广告设计、移动互联网应用开发、微信小程序开发、大型数据库管理与维护等工作。'
            ],
            imgSrc: [
                {src: require('@/assets/img/yy_01.jpg'),text: '教师到企业调研'},
                {src: require('@/assets/img/yy_02.jpg'),text: '实训基地建设'},
                {src: require('@/assets/img/yy_03.jpg'),text: '教师指导学生参加技能竞赛'}
            ]
        }
    },
    components: {
        alutext
    }
}
</script>

<style scoped>
.apply{
    margin-left: 20px;
    padding: 0px 15px 0px 15px;
    box-sizing: border-box;
}
.apply > h2{
    text-align: center;
    font-size: 24px;
    color: #575959;
} 
</style>