<template>
    <div class="inernet">
        <h2>物联网应用技术专业简介</h2>
        <alutext :title="titleList" :imgSrc="imgSrc"></alutext>
    </div>
</template>

<script>
import alutext from "./alutext";

export default {
    data () {
        return {
            titleList: [
                ' 物联网是国家的重点发展的十大战略性新兴产业之一，在基础研宄、产品开发、设备制造、系统集成等领域都需要大量的人才。',
                '一、培养目标：主要培养具备智能芯片、传感器、RFID、无线网络、嵌入式开发等基础知识，能从事物联网项目的规划、设计与施工、物联网设备安装、调试与维护、物联网产品的辅助设计及制造等工作的应用型高级人才。',
                '二、师资队伍：本专业师资力量雄厚，现有专兼职教师15人，其中：教授1名，副高职称5人，中级职称5人，初级职称4名。在科研教改方面，本专业承担厅级以上的利研项目6项，开发了5个管理系统，在国内正式刊物上发表论文27篇，编写教材及实训指导书8部。',
                '三、主干课程：物联网工程导论、传感器原理与应用、RFID技术与应用、交换机与路由器原理及配置、无线组网技术、.NET框架应用开发、物联网数据库应用、数字电子技术、网络安全技术应用、ARM嵌入式技术与应用、物联网单片机原理及应用和物联网综合项目开发等。',
                '四、实训基地建设：物联网应用技术专业具有良好的实验实习环境，目前拥有物联网综合应用实验室、智能家居实验室、智能仓储实验室、智慧工厂实训室、传感器实训室、嵌入式实训室、物联网综合布线实验室等6个专业实验室，这些实验室集教学、实验、创新、体验和研发功能于一体，为广人师生开展基本教学实验和科研项目研究提供了良好的环境。',
                '五、就业方向：主要面向智能交通、智能物流、智能电网、智能医疗〔公共卫生与远程医疗〕、智能工业、智能农业、环境监控与灾害预警、智能家居（楼宇自动化）、公共安全（信息安全管理）、社会公共事业、金融（电子商务）服务业等领域的企事业单位，从事物联网项目的规划、设计施工、管理与维护等工作。'
            ],
            imgSrc: [
                {src: require('@/assets/img/yy_04.jpg'),text: '物联网智慧工厂实验室'},
                {src: require('@/assets/img/yy_05.jpg'),text: '物联网应用技术专业斩获第三届星火杯工作过程知识比赛一等奖'},
                {src: require('@/assets/img/yy_06.jpg'),text: '物联网16级运动会上喜获丰收'}
            ]
        }
    },
    components: {
        alutext
    }
}
</script>

<style scoped>
.inernet{
    margin-left: 20px;
    padding: 0px 15px 0px 15px;
    box-sizing: border-box;
}
.inernet > h2{
    text-align: center;
    font-size: 24px;
    color: #575959;
} 
</style>