<template>
    <div class="manage">
        <h2>计算机信息管理专业简介</h2>
        <alutext :title="titleList" :imgSrc="imgSrc"></alutext>
    </div>
</template>

<script>
import alutext from "./alutext";

export default {
    data () {
        return {
            titleList: [
                ' 计算机信息管理专业于2000年经广西教育厅批准开设，经过多年的建设与发展，形成了独特的办学特色。拥有较高教学水平和较强实践能力、结构合理、相对稳定的专兼结合教师队伍。本专业在区内形成了一定的办学优势，近年来毕业生就业率均在98%以上。',
                '一、专业特色：本专业主动适应国家 “互联网+”行动计划战略需要，以网站设计与维护作为人才培养方向，在教学中引入CDIO国际先进教育理念，以全人发展教育为目标，以CDIO项目教学为主线，充分挖掘学生的潜能，以网站设计开发到网站运行管理的生命周期为载体 ,让学生以主动的、 实践的、 课程之间有机联系的方式开展学习。',
                '二、培养目标：培养具有美工、网站前端开发、网站后台开发、网站运营与维护等能力的高素质技术技能型人才。',
                '三、主干课程：Photoshop高级图像处理、网页界面设计、图形设计、UI设计、网页动画制作、网页布局（DIV+CSS）、程序设计基础（Java）、数据库管理系统基础、Web前端技术、PHP应用开发、移动应用开发（Android）、专业项目、职业素质拓展等。',
                '四、就业方向：毕业生可在IT企业、政府机关、事业单位以及商贸业、服务业等从事计算机网站的规划建设与管理维护、网页设计与网站开发、淘宝网店与微店美工、电子商务、互联网信息采集、移动应用开发以及办公自动化等工作。',
                '五、师资队伍：本专业注重师资队伍建设，现有专兼职教师13人，其中高级职称3人，中级职称8人，初级职称2人。团队教师教学经验丰富，素质过硬，专业技能与教学水平齐头并进。除了高质量完成教学任务，团队教师还不断在实践中开展改革创新，学习先进教育理念，创新育人模式。在由国家教育部主办的“2018年全国职业院校技能大赛职业院校教学能力比赛”中，专业团队的韦波、李敏等几位教师完成的教学设计作品《随“屏”而变——网页的Flex弹性布局》荣获了一等奖，这是我院首次在全国性的教师教学能力比赛中获得一等奖，实现了历史性突破！该成绩是本专业团队教师教学能力与综合素质的集中展现，也是专业建设的一项标志性成果。'
            ],
            imgSrc: [
                {src: require('@/assets/img/yy_07.jpg'),text: '团队教师在“2018年全国职业院校技能大赛职业院校教学能力比赛”中荣获一等奖'},
                {src: require('@/assets/img/yy_08.png'),text: '第十二届广西大学生计算机应用大赛一等奖作品《不忘初心，西藏继续前进》,作者：信息1601班--梁琼心、李林蔚、钟其彬'},
                {src: require('@/assets/img/yy_09.jpg'),text: '第十一届广西高校计算机应用大赛一等奖作品《丝路青年》，作者：信息1501班—孙家宝等'}
            ]
        }
    },
    components: {
        alutext
    }
}
</script>

<style scoped>
.manage{
    margin-left: 20px;
    padding: 0px 15px 0px 15px;
    box-sizing: border-box;
}
.manage > h2{
    text-align: center;
    font-size: 24px;
    color: #575959;
} 
</style>