<template>
    <div class="present">
        <h2>计算机网络技术专业简介</h2>
        <alutext :title="titleList" :imgSrc="imgSrc"></alutext>
    </div>
</template>

<script>
import alutext from "./alutext";

export default {
    data () {
        return {
            titleList: [
                '计算机网络技术专业开设于2003年，经过14的建设，积累了丰富的教学资源，建有6个校内实训基地，有高档路由器、交换机和防火墙等先进网络实验设备，能满足教学及实验的需要；拥有一支具有较高教学水平和较强实践能力的教师队伍；毕业生深受企业欢迎，近年来毕业生就业率均在99%以上，双证率达98%以上， 2015年获得校级就业先进集体称号。',
                '一、培养目标：本专业培养适合市场需求，德、智、体、美全面发展，掌握一定的专业理论知识，具有良好的职业道德和创新精神，具备计算机网络规划设计、网络设备配置、网络系统组建和优化，网络故障排除、网络安全保障、网络软件开发、网站设计、服务器管理等能力的应用型高级技术人才。',
                '二、师资队伍：现有专职教师12人，其中：高级职称4人，中级职称8人，每个教师具有硕士研究生以上学历；企业兼职教师5人，都具有高级职称，是管理人员或者技术主管。在科研教改方面，本专业承担厅级以上的科研项目共5项，院级科研项目16项，在国内正式刊物上发表论文40多篇，出版高职高专规划教材4部，校本教材教参3部。',
                '三、主干课程：路由器与交换机原理及配置、CCNA认证课程、网络系统集成与工程设计、综合布线技术与标准、计算机网络基本原理、Windows组网技术、Linux系统管理与组网技术、网络数据库SQL Server、Oracle数据库管理、 C#程序设计、ASP.NET、网络安全应用技术、计算机网络系统管理等。',
                '四、实训基地建设：网络基础技术中心、网络系统集成技术中心、网络信息安全技术中心、网络综合布线实训中心、思科网络技术中心、学院网络管理中心等6个校内实训基地。与广西计算中心建立了校外实习、实训基地。',
                '五、就业方向：毕业生可在电信网络、计算机网络、广电网络等技术领域，从事研究开发、技术管理等工作，也可在工业企业、事业和政府等部门以及教育、科研等企事业单位从事网络工程、网络维护、网络管理等工作,以及新兴通信网络企业（4G及物联网相关企业）的网络管理与维护等工作，以及网络设备销售等工作。'
            ],
            imgSrc: [
                {src: require('@/assets/img/yy_13.jpg'),text: '学生参加全国职业技能大赛广西选拔赛计算机网络应用赛项'},
                {src: require('@/assets/img/yy_14.jpg'),text: '思科网络学院'},
                {src: require('@/assets/img/yy_15.jpg'),text: '网络综合布线实训台'}
            ]
        }
    },
    components: {
        alutext
    }
}
</script>

<style scoped>
.present{
    margin-left: 20px;
    padding: 0px 15px 0px 15px;
    box-sizing: border-box;
}
.present > h2{
    text-align: center;
    font-size: 24px;
    color: #575959;
}
</style>