<template>
    <div class="skill">
        <h2>软件技术专业简介</h2>
        <alutext :title="titleList" :imgSrc="imgSrc"></alutext>
    </div>
</template>

<script>
import alutext from "./alutext";

export default {
    data () {
        return {
            titleList: [
                '当前世界正进入以信息产业为主导的新经济发展时期，“软件定义世界”正成为各方共识。无论是基于“互联网＋”的网络化、平台化、智能化现代服务业，还是推动产业转型升级的工业互联网，都需要依靠软件来推动变革。软件已成为提升国家信息化水平、加快推进智能制造的重要力量。%以上。',
                '软件技术专业是广西机电职业技术学院重点建设专业之一，本专业的前身是计算机应用技术专业（程序设计方向），分方向教学从2001年办学至今，培养了大批高素质技能型人才，积累了丰富的办学经验，形成了能适应当今行业岗位要求的比较完善的教学计划，并于2009年成立了软件技术专业，2010年计算机应用与软件技术实训基地被评为“自治区示范性高等职业教育实训基地”，2014年获得校级就业先进集体称号。',
                '一、培养目标：本专业培养德、智、体、美全面发展，掌握计算机软件基础理论与知识，掌握软件项目管理和实施规范技术，具备良好的软件设计与开发技能，能熟练运用国际主流软件开发技术进行C/S、B/S多层框架应用程序开发，能够独立开发中小规模的计算机及移动应用程序，具有较强的实践技能和创新能力，适应软件行业设计、开发、测试、维护、管理、服务第一线需要的应用型高级技术人才。',
                '二、师资队伍：本专业注重师资队伍建设，以重点培养和合理引进相结合，从高校、企业中不断引进思想素质过硬，业务能力强的高职称、高学历、高素质人才。现有专兼职教师10人，其中：教授1人，高级职称3人，中级职称6人。专业团队教师积极开展科研工作，承担了《计算机应用与软件技术专业领域技能型紧缺人才培养培训基地》等国家级项目4项，《基于云计算的校园网数据管理研究与应用》等厅级以上的科研项目共20项，院级科研项目10项，在国内正式刊物上发表论文30多篇，出版了《SQL Server2005实用教程》等高职高专规划教材4部，形成了一支拥有丰富实践教学经验的师资队伍。',
                '三、主干课程：专业课程围绕.NET框架开发、Java框架开发及移动应用开发三条主线开展教学，核心课程如下：Web前端设计(Javascript、HTML5、DIV、CSS3)、网页美工、计算机网络技术、程序设计基础、软件工程、数据库应用技术（SQL Server）、数据库管理与应用（Oracle）、基于三层架构的Web应用开发、基于MVC架构的Web项目开发、PHP应用开发、数据结构与算法、Java程序设计、JSP应用开发、移动程序设计、移动应用项目开发。',
                '四、就业方向：毕业生可在企事业单位从事Java工程师、.Net工程师、软件测试工程师、数据库管理员、软件实施与营销等岗位工作。'
            ],
            imgSrc: [
                {src: require('@/assets/img/yy_10.jpg'),text: '主干课程'},
                {src: require('@/assets/img/yy_11.jpg'),text: '实训基地建设'},
                {src: require('@/assets/img/yy_12.jpg'),text: '实训基地'}
            ]
        }
    },
    components: {
        alutext
    }
}
</script>

<style scoped>
.skill{
    margin-left: 20px;
    padding: 0px 15px 0px 15px;
    box-sizing: border-box;
}
.skill > h2{
    text-align: center;
    font-size: 24px;
    color: #575959;
} 
</style>