<template>
    <div class="introduction">
        <div class="content-left">
            <ul class="list">
                <li v-for="(item,index) in contList" :key="index">
                    <a :href="item.link">{{item.text}}</a>
                </li>
            </ul>
        </div>
        <div class="content-right">
            <img src="../assets/img/2.jpg" alt="">
            <div class="text">
                <p v-for="(text, index) in textList" :key="index">{{text}}</p>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    data() {
        return {
            contList: [
                {text: '学院简介', link: ''},
                {text: '历史沿革', link: ''},
                {text: '学院荣誉', link: ''},
                {text: '校园风景', link: ''},
                {text: '校徽校训', link: ''},
                {text: '校风学风', link: ''},
                {text: '媒体机电', link: ''},
                {text: '学院地图', link: ''},
                {text: '技术中心', link: ''}

            ],
            imgSrc: '../assets/img/2.jpg',
            textList: [
                '广西机电职业技术学院始建于1958年，坐落在“中国绿城”广西首府南宁市美丽的相思湖畔、邕江之滨，是经教育部批准成立的一所公办全日制普通高等职业院校，隶属广西壮族自治区工业和信息化厅，是全国首批、广西首家国家示范性骨干高职院校，全国高职高专院校人才培养工作水平评估优秀学院，国家示范性高职建设重点培育8所院校之一，创新发展行动计划（2015-2018）优质校。',
                '学院占地776亩，校舍面积38.73万平方米，固定资产5.1亿元。现有全日制在校生1.3万多人，是广西第一所全日制在校生超过万人的高职院校。毕业生初次就业率连续17年保持在90%以上，毕业生就业质量逐年提高，用人单位对毕业生综合评价的满意度达到98%以上，位居广西高职院校首位。',
                '学院现有教职工615人，双师素质教师比例达到91.5%，其中教授、副教授、高级工程师等高级职称教师达教师总数的33.6%；具有研究生学历的教师达教师总数的56.5%。其中有广西五一劳动奖章获得者3人，自治区教学名师3人，广西技能大奖获得者5人，广西技术能手13人，广西五四青年奖章获得者1人，广西“高校优秀人才资助计划”入选5人，广西创新人才培养教学团队3个，自治区级优秀教学团队6个。学院还汇集知名企业中的国家技术能手和广西技术能手，在校内组建了4 个技能大师工作室，拥有了一支“专业带头人＋骨干教师＋兼职型能工巧匠”的结构合理的专兼职教学科研团队。',
                '学院紧扣广西及北部湾经济发展和产业布局，动态调整和优化学科专业体系，积极打造具有竞争力的特色优势专业。学院现设有10个教学部门，59个专业（含方向），其中，国家级教改试点专业2个，中央财政支持重点建设专业2个，全国职业院校装备制造类示范专业2个，全国职业院校交通运输类示范专业1个，国家示范性高职骨干重点建设专业及专业群6个，全国机械行业技能人才培养特色专业3个，广西教改试点专业4个，广西优质专业14个，广西特色专业9个，服务北部湾经济区开放开发专业21个，服务做大做强做优广西工业专业23个，服务社会主义新农村专业8个，自治区示范特色专业5个。学院拥有国家精品课程1门、教育部教学指导委员会精品课程1门、自治区精品课程14门、自治区级教学成果奖12项。',
                '目前，学院教学仪器设备总值达2.25亿元，拥有22个在同类院校中装备最优、规模最大、功能最全的校内实训中心、158个实训实验室和21个职业技能培训鉴定中心，是国家高技能人才（机电项目）培训基地、国家技能型紧缺人才培训基地、中国模具人才培训基地、中央职业教育数控技术实训基地、IT职业技术教育工程定点院校、广西中职师资培训基地等国家级和省级职业培训基地。已在广西玉柴机器、上汽通用五菱、广西华银铝业等区内外近500家企业建成校外实训基地，并在柳州、玉林、桂林、北海等广西产业集群优势区域设立了校企合作工作站。',
                '2005年，学院在全国同类高校中率先同时通过GB/T19000质量管理标准和GB/T28001职业健康安全管理标准认证，按该标准建立健全了一套完整的教育质量监控保障管理体系，加强了教育质量和安全稳定工作的过程控制，实现了教育教学质量的稳步持续提高，管理成效明显。',
                '学院始终坚持“以人为本，规范管理，办好人民满意的高等职业教育”的办学质量方针，以学生需求为根本，深化教育教学改革，全面提升学生综合素质和就业竞争力。学院学生在国际、国内、区内各级各类职业技能比赛中屡获大奖，在广西同类高职院校中处于领先地位。学院以服务社会为己任，充分发挥国家示范性骨干高职院校的示范引领作用，带动广西乃至西部地区职业教育的发展，并辐射至东盟地区。面向社会以及东盟国家有针对性地开设各种职业资格培训、鉴定及各种短期培训；为企事业单位提供直接技术服务；与东盟国家30多所院校建立合作交流关系；与国内10余所职业院校结成了对口支援关系。',
                '学院先后被评为首批广西高端应用型本科人才联合培养改革试点单位、广西首批示范性高职院校、自治区文明单位、自治区和谐学校、广西职业教育先进单位、广西高技能人才培养培训突出贡献奖、广西高校就业工作先进单位、全区普通高校毕业生就业创业工作“突出单位”，广西高校安全文明校园、全国机械行业文明单位、全国绿化模范单位、教育部高校校园文化建设成果优秀奖。',
                '九万里鲲鹏正举，北部湾风生水起。站在新的历史起点，全院师生员工将继续秉承 “自强弘毅 知行合一”的校训，以一流的教育服务，一流的人才培养模式和一流的师资力量，培养一流的应用型高级技术人才高技能人才，将学院建成地方技能型高水平大学。'
            ]
        }
    }
}
</script>

<style scoped>
    .introduction{
        width: 1170px;
        margin: 0px auto;
    }
    .content-left{
        float: left;
        display: inline-block;
        width: 18%;
        margin-top: 20px;
        box-sizing: border-box;
    }
    .content-right{
        float: left;
        display: inline-block;
        width: 80%;
        margin-top: 20px;
        box-sizing: border-box;
    }
    .list li{
        list-style: none;
        padding: 5px 0px;
        width: 40%;
        border-bottom: 1px solid #eeeeee;
        text-align: center;
    }
    .list li a{
        text-decoration: none;
        color: #7b7b7b;
        font-size: 14px;
    }
    .list li:hover a{
        color: #b5b5b5;
    }
    .content-right img{
        display: inline-block;
        width: 100%;
    }
    .text{
        font-size: 16px;
        color: #0b0b0b;
        text-indent: 2em;
    }
</style>