<template>
  <div class="talent">
    <div class="talent-box">
      <img :src="headImg" alt />
      <h2>
        <span>[系部介绍]</span>
        <span>INTRODUCTION OF DEPARTMENT</span>
      </h2>
      <p v-for="(text,index) in textList" :key="index">{{text}}</p>
      <img :src="footImg" alt />
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      headImg: require("@/assets/img/xb_01.jpg"),
      footImg: require("@/assets/img/xb_02.jpg"),
      textList: [
        "计算机与信息工程系是学院成立最早的系部之一，形成了以应用为特色，软、硬件并重，教学和技术开发兼顾的办学风格。现有计算机应用技术、软件技术、计算机网络技术、物联网应用技术、计算机信息管理（网站设计与维护）、摄影摄像技术等6个专业，在校生1212多人，其中计算机应用技术为自治区优质专业。十几年来，已有5000多名毕业生走上工作岗位，绝大多数毕业生实践能力和创新能力突出，成为用人单位的技术骨干或管理骨干，深受用人单位的欢迎，历年就业率均保持在98%以上。师资力量雄厚。现有专兼职教师65人，其中教授3人，副高级职称教师13人，中级职称教师40人；研究生学历或硕士学位23人。近一半教师来自企业或行业的技术骨干，既有深厚的理论功底又有丰富的实践经验，通过了多种IT新技术职业技能认证，现场实践教学能力突出；已出版10余套高职高专规划教材，并在区内高职院校广泛使用，受到好评；教师承担多项科研项目，共发表论文100多篇；近年来师生们在区内外各类计算机技能大赛中成绩喜人，产生了3名“广西技术能手”、4名“行业技术能手”；学生研发的“万能证书套打系统”荣获首届“全国高职高专‘发明杯’大学生创新大赛”发明制作类发明创新铜奖（广西唯一获该类奖项单位）；“新耶稣受难记”学生作品在2006中外职业技术院校大学生设计创作大赛中荣获视觉传达设计类铜奖；在全国第二届计算机（微机）调试员职业技术大赛广西选拔赛荣获团体第一名。",
        "已建成设施完善、功能齐全的校内技术中心5个，专业实训室11个，15个常年校外实习基地。校内现有计算机设备700多台套、网络设备180多台套、30多种行业流行软件以及投影仪、摄影机、数码相机等一批市场流行的最先进的设备，设备总值达600多万元。技术中心包括计算机基础技术中心（2002年荣获高校合格实验室）、软件开发与维护技术中心、网站设计与维护技术中心、计算机网络技术中心、多媒体与影视技术中心、物联网综合技术中心；2009年初，由这5个技术中心组成的计算机应用与软件技术实训基地被自治区教育厅评为省级示范性建设实训基地。实训室包括计算机组装和维护实训室、软件设计实训室、软件编码实训室、软件测试实验室、软件维护实训室、网站设计与维护实训室、网络技术基础实训室、网络系统集成实训室、网络综合布线实训室、多媒体技术实训室、影视技术实训室、物联网技术实训室等；为学生提供良好的实验和训练环境，使学生受到贴近岗位实际的训练。",
        "我系十分重视职业技能认证，设有国家人力资源和社会保障部职业技能鉴定中心授权的计算机高新技术考试站、ATA考试站和思科网络技术学院，是教育部考试中心授权的全国计算机等级考试考点，有权对中高级软件操作员、数据库操作员、网络操作员、微机系统维修员、图像制作员、网页设计师、平面设计师、影视特效专家、视频编辑专家、程序员、华为助理工程师、思科认证网络支持工程师（CCNA）等进行认证考试。坚持实施学历教育与职业资格认证相结合的“双证”教育，与南宁市平方软件新技术有限责任公司、重庆中联信息产业有限公司、广州多迪网络科技有限公司等区内外企业建立了长期合作关系，实现人才培养与岗位需求的无缝连接。"
      ]
    };
  }
};
</script>

<style scoped>
.talent {
  width: 1170px;
  margin: 0 auto;
}
.talent-box {
  width: 90%;
  margin: 20px auto 0px auto;
  margin-left: 20px;
  padding: 0px 15px 0px 15px;
  box-sizing: border-box;
}
.talent-box img {
  width: 100%;
}
.talent-box > p {
  text-indent: 2em;
  font-size: 16px;
  line-height: 30px;
  color: #575959;
}
.talent h2 {
    margin-bottom: 0px;
  color: #7f7677;
  background: url("../assets/img/name_bg.png") no-repeat left;
  background-size: 100% 40%;
  padding-bottom: 50px;
}
.talent h2 span:nth-child(1) {
  font-size: 20px;
  padding-left: 10px;
}
.talent h2 span:nth-child(2) {
  font-size: 13px;
  letter-spacing: 2px;
}
</style>